---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachedParam
source: html/64223144-4a10-e81d-906b-cc2b802072f8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColumnBaseAttachedParam Property

"Base is Attached"

## Syntax (C#)
```csharp
public static ForgeTypeId ColumnBaseAttachedParam { get; }
```